app/views/devise/registrations/new.html.erb

SELECT "roles".* FROM "roles"
---

<% for role in Role.all %>