app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("candidatedetails", "company", "contactdetails", "created_at", "designation", "educationqualification", "experience", "jobdescription", "jobspecification", "location", "role", "rolecategory", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "candidatedetails" = ?, "contactdetails" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["candidatedetails", "1. Must have 15 Years Education with aggregation of 60% "], ["contactdetails", "9879875893"], ["updated_at", Fri, 21 Feb 2014 11:15:35 UTC +00:00]]